fabrika/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <comment>Вид договора</comment>
    <type>
      <types>EnumRef.ВидДоговораКонтрагента</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоУмолчанию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

fabrika/src/Catalogs/ДоговорыКонтрагентов/Forms/ФормаСписка/Module.bsl
//////////////////////////////////////ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ//////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("РежимВыбора") Тогда
		Элементы.Список.РежимВыбора = Параметры.РежимВыбора;
	КонецЕсли;	
	
КонецПроцедуры


/////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////









&НаСервереБезКонтекста
Процедура СписокВыборНаСервере(Договор)
	
	//Ставим признак "По умолчанию"
	Если НЕ Договор.ПоУмолчанию Тогда
		
		Отбор = Новый Структура("Организация", Договор.Организация);
		ДоговораПоУмолчанию = Справочники.ДоговорыКонтрагентов.Выбрать(, Договор.Владелец, Отбор);
		
		Пока ДоговораПоУмолчанию.Следующий() Цикл
			//
			Если ДоговораПоУмолчанию.ПоУмолчанию Тогда
				Попытка
					ДоговорОбъект = ДоговораПоУмолчанию.ПолучитьОбъект();
					ДоговорОбъект.ПоУмолчанию = НЕ ДоговорОбъект.ПоУмолчанию;
					ДоговорОбъект.Записать();
				Исключение
					Сообщить(ОписаниеОшибки());
				КонецПопытки;
			КонецЕсли;	
			//	
		КонецЦикла;
	КонецЕсли;
	
	Попытка
		ДоговорОбъект = Договор.ПолучитьОбъект();
		ДоговорОбъект.ПоУмолчанию = НЕ ДоговорОбъект.ПоУмолчанию;
		ДоговорОбъект.Записать();
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;	
	
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "ПоУмолчанию" Тогда
		СтандартнаяОбработка = Ложь;
		СписокВыборНаСервере(ВыбраннаяСтрока);
		Элемент.Обновить();
	КонецЕсли;	
	
КонецПроцедуры
